
// 成绩集合 = {

//   工程力学: {
//     学分: 4.0,
//     成绩: 60
//   },
//   结构力学: {
//     学分: 4.0,
//     成绩: 81
//   },
//   土木工程概论: {
//     学分: 1.0,
//     成绩: 85
//   }
// };

成绩集合 = [{
  学年: '2019-2020',
  学期: '1',
  课程代码: '121246',
  课程名称: 'Java程序设计',
  课程性质: '专业课',
  学分: 3.0,
  成绩: 89,
  绩点: 3.90
}, {
  学年: '2019-2020',
  学期: '1',
  课程代码: '121247',
  课程名称: 'Java程序设计课程设计',
  课程性质: '实践教学',
  学分: 2.0,
  成绩: '及格',
  绩点: 1.50
}, {
  学年: '2019-2020',
  学期: '1',
  课程代码: '121355',
  课程名称: '软件工程导论',
  课程性质: '专业基础课',
  学分: 2.5,
  成绩: 89,
  绩点: 3.90
}, {
  学年: '2019-2020',
  学期: '1',
  课程代码: '121406',
  课程名称: '专业导论',
  课程性质: '专业基础课',
  学分: 0.5,
  成绩: '优秀',
  绩点: 4.50
}, {
  学年: '2019-2020',
  学期: '1',
  课程代码: '1MT001',
  课程名称: '军事技能训练',
  课程性质: '实践教学',
  学分: 2.0,
  成绩: '良好',
  绩点: 3.50
}];
const 计算绩点 = (分数) => {
  const 绩点 = 分数 / 10 - 5;
  return 绩点.toFixed(1);
};

const 计算平均绩点 = (成绩集合) => {
  let 分母 = 0;
  let 分子 = 0;
  for (var key in 成绩集合) {
    分母 += 成绩集合[key].学分 * 成绩集合[key].绩点;
    分子 += 成绩集合[key].学分;
  }
  const 平均绩点 = 分母 / 分子;
  return 平均绩点.toFixed(1);
};

console.log(`平均绩点为${计算平均绩点(成绩集合)}`);
