// 数组排序并插入值算法挑战
//   先给数组排序，然后找到指定的值在数组的位置，最后返回位置对应的索引。

// 举例：where([1,2,3,4], 1.5) 应该返回 1。因为1.5插入到数组[1,2,3,4]后变成[1,1.5,2,3,4]，而1.5对应的索引值就是1。

// 同理，where([20,3,5], 19) 应该返回 2。因为数组会先排序为 [3,5,20]，19插入到数组[3,5,20]后变成[3,5,19,20]，而19对应的索引值就是2。

// 当你完成不了挑战的时候，可以点击'求助'。

// 以下链接可以帮助到你:

// Array.prototype.sort()

// **********************************************

// where([10, 20, 30, 40, 50], 35) 应该返回 3.
// where([10, 20, 30, 40, 50], 30) 应该返回 2.
// where([40, 60], 50) 应该返回 1.
// where([3, 10, 5], 3) 应该返回 0.
// where([5, 3, 20, 3], 5) 应该返回 2.
// where([2, 20, 10], 19) 应该返回 2.
// where([2, 5, 10], 15) 应该返回 3.

function where (arr, num) {
  // Find my place in this sorted array.
  var n;
  /* if (arr.indexOf(num) == -1){
         arr.push(num);
    }
    */
  arr.push(num);
  arr.sort((a, b) => a - b);

  n = arr.indexOf(num);

  return n;
}

console.log(where([3, 10, 5, 1], 3));
